config/cf/Catalogs/НовостиБазыЗнаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>НовостиБазыЗнаний</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектБазыЗнаний</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииБазыЗнаний</v8:Type>
						<v8:Type>cfg:CatalogRef.СтатьиБазыЗнаний</v8:Type>
						<v8:Type>cfg:CatalogRef.Комментарии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНовостейБазыЗнаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьАвтор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПользователиБазыЗнаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/cf/InformationRegisters/ПолучателиНовостейБазыЗнаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ПолучателиНовостейБазыЗнаний</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Просмотрено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Новость</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НовостиБазыЗнаний</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПользователиБазыЗнаний</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

config/cf/InformationRegisters/ИзбранноеБазыЗнаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ИзбранноеБазыЗнаний</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Создание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Изменение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Удаление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Оповещение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прочее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КатегорияБазыЗнаний</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииБазыЗнаний</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПользователиБазыЗнаний</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

config/cf/Enums/ВидыНовостейБазыЗнаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыНовостейБазыЗнаний</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изменение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удаление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оповещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/cf/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>График</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяСервиса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КалендарьРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛинияПоддержки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛинииПоддержки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Местоположение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Местоположения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Подразделение</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойстваПользователяИБ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчастиеВАвтоназначенииИсполнителей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицо</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подчиненные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подчиненный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Компетенции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Компетенция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Компетенции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/cf/Catalogs/НовостиБазыЗнаний/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Автор - СправочникСсылка.Пользователи
// Заголовок - Строка
// ТекстHTML - Строка
// ОбъектБазыЗнаний - СправочникСсылка.КатегорииБазыЗнаний, СтатьиБазыЗнаний, Комментарии
// ВидНовости - ПеречислениеСсылка.ВидыНовостейБазыЗнаний
Функция ДобавитьНовость(знач Автор, знач Заголовок, знач ТекстHTML, знач ОбъектБазыЗнаний = Неопределено, знач ВидНовости = Неопределено, Получатели = Неопределено, знач Важность = 2, знач Текст = "") Экспорт 
	
	Если ПустаяСтрока(Текст) Тогда
		Текст = СтроковыеФункцииКлиентСервер.ИзвлечьТекстИзHTML(ТекстHTML);
	КонецЕсли;
	
	Если НЕ ТипЗнч(Получатели) = Тип("Массив") Тогда
		Получатели = Новый Массив;
	КонецЕсли;
	
	Если ВидНовости = Неопределено Тогда
		ВидНовости = Перечисления.ВидыНовостейБазыЗнаний.Прочее; 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОбъектБазыЗнаний) Тогда
		ДополнитьПолучателейНовостиПоВидуИОбъекту(Получатели, ВидНовости, ОбъектБазыЗнаний);
	КонецЕсли;
	
	СоздаватьОбщуюЗапись = (ВидНовости = Перечисления.ВидыНовостейБазыЗнаний.Оповещение
		ИЛИ ВидНовости = Перечисления.ВидыНовостейБазыЗнаний.Прочее);

	Если Получатели.Количество() = 0 И СоздаватьОбщуюЗапись Тогда
		Получатели.Добавить(Справочники.Пользователи.ПустаяСсылка());
	КонецЕсли;
	
	Если Получатели.Количество() = 0 Тогда
		Возврат Справочники.НовостиБазыЗнаний.ПустаяСсылка();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЭлементОбъект = ПолучитьОбъектНовостьБазыЗнаний(Автор, Заголовок, ОбъектБазыЗнаний);
	ЭлементОбъект.Автор				= Автор;
	ЭлементОбъект.Наименование		= Заголовок;
	ЭлементОбъект.ТекстHTML			= ТекстHTML;
	ЭлементОбъект.Текст				= Текст;
	ЭлементОбъект.Дата				= ТекущаяДатаСеанса();
	ЭлементОбъект.Вид				= ВидНовости;
	Если ВидНовости = Перечисления.ВидыНовостейБазыЗнаний.Удаление Тогда
		ЭлементОбъект.ОбъектБазыЗнаний	= Справочники.Комментарии.ПустаяСсылка();
	Иначе	
		ЭлементОбъект.ОбъектБазыЗнаний	= ОбъектБазыЗнаний;
	КонецЕсли;	
	ЭлементОбъект.Важность			= Важность;		
	ЭлементОбъект.Записать();
	
	Для Каждого ПолучательСсылка Из Получатели Цикл
		
		НаборЗаписей = РегистрыСведений.ПолучателиНовостейБазыЗнаний.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Новость.Установить(ЭлементОбъект.Ссылка);
		НаборЗаписей.Отбор.Пользователь.Установить(ПолучательСсылка);
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 0 Тогда
			ЗаписьРегистра = НаборЗаписей.Добавить();
			ЗаписьРегистра.Новость		= ЭлементОбъект.Ссылка;
			ЗаписьРегистра.Пользователь	= ПолучательСсылка;
		Иначе 
			ЗаписьРегистра = НаборЗаписей[0];
		КонецЕсли;
		
		ЗаписьРегистра.Просмотрено = Ложь;
		
		НаборЗаписей.Записать(Истина);
		
	КонецЦикла;
	
	Возврат ЭлементОбъект.Ссылка;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом
// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	
КонецПроцедуры
// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДополнитьВышестоящимиКатегориями(МассивКатегорий, КатегорияСсылка)
	РодительСсылка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КатегорияСсылка, "Родитель");
	Если ЗначениеЗаполнено(РодительСсылка) Тогда
		Если МассивКатегорий.Найти(РодительСсылка) = Неопределено Тогда
			МассивКатегорий.Добавить(РодительСсылка);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьМассивКатегорийПоСтатье(СтатьяСсылка)
	
	МассивКатегорий = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", СтатьяСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатьиБазыЗнанийКатегории.Категория,
	|	СтатьиБазыЗнанийКатегории.Категория.Родитель КАК Родитель
	|ИЗ
	|	Справочник.СтатьиБазыЗнаний.Категории КАК СтатьиБазыЗнанийКатегории
	|ГДЕ
	|	СтатьиБазыЗнанийКатегории.Ссылка = &Ссылка";
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат МассивКатегорий;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если МассивКатегорий.Найти(Выборка.Категория) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		МассивКатегорий.Добавить(Выборка.Категория);
		
		Если ЗначениеЗаполнено(Выборка.Родитель) И МассивКатегорий.Найти(Выборка.Родитель) = Неопределено Тогда
			МассивКатегорий.Добавить(Выборка.Родитель);
			ДополнитьВышестоящимиКатегориями(МассивКатегорий, Выборка.Родитель);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивКатегорий;
	
КонецФункции

Процедура ДополнитьПолучателейНовостиПоВидуИОбъекту(Получатели, ВидНовости, ОбъектБазыЗнаний)
	
	Если ТипЗнч(ОбъектБазыЗнаний) = Тип("СправочникСсылка.СтатьиБазыЗнаний") Тогда
		МассивКатегорий = ПолучитьМассивКатегорийПоСтатье(ОбъектБазыЗнаний);
	ИначеЕсли ТипЗнч(ОбъектБазыЗнаний) = Тип("СправочникСсылка.Комментарии") Тогда
		СтатьяВладелец	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектБазыЗнаний, "ВладелецКомментария");
		МассивКатегорий	= ПолучитьМассивКатегорийПоСтатье(СтатьяВладелец);
	ИначеЕсли ТипЗнч(ОбъектБазыЗнаний) = Тип("СправочникСсылка.КатегорииБазыЗнаний") Тогда
		МассивКатегорий = Новый Массив;
		МассивКатегорий.Добавить(ОбъектБазыЗнаний);
		ДополнитьВышестоящимиКатегориями(МассивКатегорий, ОбъектБазыЗнаний);
		
		// Если добавили категорию на самый первый уровень тогда оповестим всех
		Если МассивКатегорий.Количество() = 1 И ВидНовости = Перечисления.ВидыНовостейБазыЗнаний.Создание Тогда
			Получатели.Добавить(Справочники.Пользователи.ПустаяСсылка());
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ПеречислениеМенеджер = Перечисления.ВидыНовостейБазыЗнаний;
	
	СоответствиеТипов = Новый Соответствие;
	СоответствиеТипов.Вставить(ПеречислениеМенеджер.Создание	, "Создание");
	СоответствиеТипов.Вставить(ПеречислениеМенеджер.Изменение	, "Изменение");
	СоответствиеТипов.Вставить(ПеречислениеМенеджер.Удаление	, "Удаление");
	СоответствиеТипов.Вставить(ПеречислениеМенеджер.Оповещение	, "Оповещение");
	СоответствиеТипов.Вставить(ПеречислениеМенеджер.Прочее		, "Прочее");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());
	Запрос.УстановитьПараметр("Категории", МассивКатегорий);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ИзбранноеБазыЗнаний.Пользователь
	|ИЗ
	|	РегистрСведений.ИзбранноеБазыЗнаний КАК ИзбранноеБазыЗнаний
	|ГДЕ
	|	ИзбранноеБазыЗнаний.КатегорияБазыЗнаний В(&Категории)
	|	И ИзбранноеБазыЗнаний.Пользователь <> &ТекущийПользователь
	|	И ИСТИНА";
	РеквизитыУсловия = СоответствиеТипов.Получить(ВидНовости);
	Если НЕ РеквизитыУсловия = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ИСТИНА", "И " + РеквизитыУсловия);
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Получатели.Найти(Выборка.Пользователь) = Неопределено Тогда
			Получатели.Добавить(Выборка.Пользователь);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьОбъектНовостьБазыЗнаний(Автор, Заголовок, ОбъектБазыЗнаний)
	
	ДатаНовости = ТекущаяДатаСеанса();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Заголовок"			, Заголовок);
	Запрос.УстановитьПараметр("НачалоДня"			, НачалоДня(ДатаНовости));
	Запрос.УстановитьПараметр("КонецДня"			, КонецДня(ДатаНовости));
	Запрос.УстановитьПараметр("ОбъектБазыЗнаний"	, ОбъектБазыЗнаний);
	Запрос.УстановитьПараметр("Автор"				, Автор);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	НовостиБазыЗнаний.Ссылка
	|ИЗ
	|	Справочник.НовостиБазыЗнаний КАК НовостиБазыЗнаний
	|ГДЕ
	|	НовостиБазыЗнаний.Наименование = &Заголовок
	|	И НовостиБазыЗнаний.Дата МЕЖДУ &НачалоДня И &КонецДня
	|	И НовостиБазыЗнаний.ОбъектБазыЗнаний = &ОбъектБазыЗнаний
	|	И НовостиБазыЗнаний.Автор = &Автор";
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		УстановитьПривилегированныйРежим(Истина);
	    Возврат Справочники.НовостиБазыЗнаний.СоздатьЭлемент();
	Иначе 
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		Возврат Выборка.Ссылка.ПолучитьОбъект();
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
